In [1]:
import pandas as pd
import numpy as np
df=pd.read_csv("D:\Symbiosis\Dataset\Teams.csv")
df

    Points  Rank    Team  Year
0      876     1  Riders  2014
1      789     2  Riders  2015
2      863     2  Devils  2014
3      673     3  Devils  2015
4      741     3   Kings  2014
5      812     4   Kings  2015
6      756     1   Kings  2016
7      788     1   Kings  2017
8      694     2  Riders  2016
9      701     4  Royals  2014
10     804     1  Royals  2015
11     690     2  Riders  2017

In [26]:
#dataframe.groupby("Column name")

teams=df.groupby("Team")

#to get the group
print(teams.groups)   #dictionary of groups(key=>group name)
                       #,value=>[list of rows]

#groupby_obj.get_group("Group name")
print(teams.get_group("Royals"))
print(teams.get_group("Royals")["Points"].max())

{'Devils': [2, 3], 'Kings': [4, 5, 6, 7], 'Riders': [0, 1, 8, 11], 'Royals': [9, 10]}
    Points  Rank    Team  Year
9      701     4  Royals  2014
10     804     1  Royals  2015
804

In [10]:
#1.group by the team & display all teams
#2.print all riders teams details
#3.print the max point of year 2014
#4.print all rank 1 teams
#5.print each team highest point
#6.print each team avg point

In [36]:
#2.print all riders teams details
print(teams.get_group("Royals"))

    Points  Rank    Team  Year
9      701     4  Royals  2014
10     804     1  Royals  2015

In [35]:
#3.print the max point of year 2014
year=df.groupby("Year")
print(year.get_group(2014)["Points"].max())

876

In [34]:
#4.print all rank 1 teams
rank=df.groupby("Rank")
print(rank.get_group(1))

    Points  Rank    Team  Year
0      876     1  Riders  2014
6      756     1   Kings  2016
7      788     1   Kings  2017
10     804     1  Royals  2015

In [33]:
#5.print each team highest point
print(teams["Points"].max())

Team
Devils    863
Kings     812
Riders    876
Royals    804
Name: Points, dtype: int64

In [32]:
#6.print each team avg point
print(teams["Points"].mean())

Team
Devils    768.00
Kings     774.25
Riders    762.25
Royals    752.50
Name: Points, dtype: float64

In [ ]:
import pandas as pd
n=int(input("how many student add"))
roll=[]
name=[]
marks=[]
for i in range(n):
    rl=input("enter the roll number:")
    nm=input("enter the name")
    mk=input("enter the marks:")
    roll.append(rl)
    name.append(nm)
    marks.append(mk)
Student={"roll":roll,"name":name,"marks":marks}
stud=pd.DataFrame(Student)
print(stud)

In [2]:
import pandas as pd
Student={"roll":[1,2,3,4,5],"name":["ram","sham","karan","vijay","sachin"],"marks":[10,20,25,35,45]}
stud=pd.DataFrame(Student)
print(stud)

   roll    name  marks
0     1     ram     10
1     2    sham     20
2     3   karan     25
3     4   vijay     35
4     5  sachin     45

In [20]:
ch=int(input("enter your choice:"))
if(ch==1):
       print(stud.append({"roll":6 ,"name":"pravin" ,"marks":20},ignore_index=True))
elif (ch==2):
       print(stud.drop([1],inplace=True))
print(stud)

enter your choice:1
   roll    name  marks
0     1     ram     10
1     3   karan     25
2     4   vijay     35
3     5  sachin     45
4     6  pravin     20
   roll    name  marks
0     1     ram     10
2     3   karan     25
3     4   vijay     35
4     5  sachin     45

   roll    name  marks
0     1     ram     10
2     3   karan     25
3     4   vijay     35
4     5  sachin     45